
**Series**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
labels=['a','b','c','d']
list=[1,2,3,4]
arr=np.array(list)
d={'a':1,'b':2,'c':3,'d':4}

In [ ]:
pd.Series(data=list)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
pd.Series(data=list,index=labels)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
pd.Series(arr,labels)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
pd.Series(d)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
ser1=pd.Series((1,2,3,4),index=['italy','usa','japan','America'])

In [ ]:
ser2=pd.Series((7,8,9,5),index=['a','usa','c','America'])

In [ ]:
ser1+ser2

America     9.0
a           NaN
c           NaN
italy       NaN
japan       NaN
usa        10.0
dtype: float64

**Data frames**=collection of number of series

In [ ]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(45)

In [ ]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A  0.026375  0.260322 -0.395146 -0.204301
B -1.271633 -2.596879  0.289681 -0.873305
C  0.394073  0.935106 -0.015685  0.259596
D -1.473314  0.801927 -1.750752 -0.495052
E -1.008601  0.025244 -0.121507 -1.546873

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [ ]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [ ]:
df['new']=df['W']+df['Y']
df['new']

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [ ]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [ ]:
df.drop('new',axis=1,inplace=True)

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**Selecting rows**

In [ ]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [ ]:
df.iloc[2]
#selecting based on row with index value

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
df.loc['B','Y']

-0.8480769834036315

In [ ]:
df.loc[['B','C'],['W','Y']]

          W         Y
B  0.651118 -0.848077
C -2.018168  0.528813

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [ ]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df=pd.DataFrame({'col':[1,2,3,4],'col2':[123,124,125,126],'col3':['abc','efg','ert','rbc']})

In [ ]:
df['col2'].unique()

array([123, 124, 125, 126])

In [ ]:
df['col2'].nunique()

4

In [ ]:
df['col2'].value_counts()

126    1
125    1
124    1
123    1
Name: col2, dtype: int64

**SELECT DATA**

In [ ]:
newdf=df[(df['col']>2)& (df['col2']==123)]
newdf

Empty DataFrame
Columns: [col, col2, col3]
Index: []

APPLYING FUNCTION

In [ ]:
def times2(x):
  return x*2

In [ ]:
df['col'].apply(times2)

0    abcabc
1    efgefg
2    ertert
3    rbcrbc
Name: col, dtype: object

In [ ]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df['col2'].sum()

498

In [ ]:
del df['col']

In [ ]:
df

   col2 col3
0   123  abc
1   124  efg
2   125  ert
3   126  rbc

GET COLUMS AND INDEX

In [ ]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

SORTING AND ORDERING OF DATA FRAME

In [ ]:
df.sort_values(by='col2')

   col2 col3
0   123  abc
1   124  efg
2   125  ert
3   126  rbc

In [ ]:
df.sort_values(by='col2',inplace=True)

In [ ]:
df

   col2 col3
0   123  abc
1   124  efg
2   125  ert
3   126  rbc

In [ ]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False